# Eksik Veri

In [20]:
import pandas as pd
import numpy as np

In [21]:
sozlukVerisi={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [22]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [23]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [24]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [29]:
yeniVeri={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniVeriDataFrame=pd.DataFrame(yeniVeri)

In [30]:
yeniVeriDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [31]:
yeniVeriDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [32]:
yeniVeriDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# groupby

In [46]:
maasSozlugu= {"Departman": ["Yazilim","Yazilim","Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Calisan Ismı":["Ahmet","Mehmet","Atil","Burak","Miray","Zeynep"],
             "Maas":[100,200,300,400,500,600]}

In [47]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [48]:
maasDataFrame

   Departman Calisan Ismı  Maas
0    Yazilim        Ahmet   100
1    Yazilim       Mehmet   200
2  Pazarlama         Atil   300
3  Pazarlama        Burak   400
4      Hukuk        Miray   500
5      Hukuk       Zeynep   600

In [50]:
grupObjesi=maasDataFrame.groupby("Departman")

In [51]:
grupObjesi.count()

           Calisan Ismı  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazilim               2     2

In [52]:
grupObjesi.mean()

            Maas
Departman
Hukuk      550.0
Pazarlama  350.0
Yazilim    150.0

In [53]:
grupObjesi.min()

          Calisan Ismı  Maas
Departman
Hukuk            Miray   500
Pazarlama         Atil   300
Yazilim          Ahmet   100

In [55]:
grupObjesi.max()

          Calisan Ismı  Maas
Departman
Hukuk           Zeynep   600
Pazarlama        Burak   400
Yazilim         Mehmet   200

In [56]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazilim     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0